import React, { useState } from 'react'
import { Link } from 'react-router-dom'
import {FaAddressBook, FaArchive, FaBook, FaBookOpen, FaCalendarDay, FaCog, FaHome, } from 'react-icons/fa'
function Home() {
  const[Sidebar ,setsidebar]=useState(false)

  const toggle= ()=>{
    setsidebar(!Sidebar)
  }
  return (
    <>
  <div className='flex'>
  
    
    
            {Sidebar ? <div className='bg-slate-500  block w-80'>
             
         <ul className='mt-6 text-white font-bold' >
             <li className='mb-4 rounded hover:shadow hover:bg-blue-300 py-2'>
               
                 <a href="" className='px-3'>
                      <FaBookOpen className='inline-block w-8 h-6 mr-6'> <a href="" className='px-3'></a></FaBookOpen> 
                
                 </a>
                 <Link className='inline-block' to='mezmur'> <li>መዝሙር</li></Link> 
             </li>

             <li className='mb-4 rounded hover:shadow hover:bg-blue-300 py-2'>
                
                 <a href="" className='px-3'>
                      <FaBook className='inline-block w-8 h-6 mr-6'></FaBook> 
                    
                 </a>
                 <Link className='inline-block '  to='shortmezmur'><li>ሓጺር መዝሙር</li ></Link > 
             </li> 

             <li className='mb-4 rounded hover:shadow hover:bg-blue-300 py-2'>
                 <a href="" className='px-3'>
                      <FaHome className='inline-block w-8 h-6 mr-6'></FaHome> 
                   
                 </a>
                 <Link className='inline-block ' to='wereb'><li> ወረብ</li></Link>
             </li> 

             <li className='mb-4 rounded hover:shadow hover:bg-blue-300 py-2'>
                 <a href="" className='px-3'>
                      <FaAddressBook className='inline-block w-8 h-6 mr-6'></FaAddressBook> 
                   
                 </a>
                 <Link className='inline-block ' to='sbket'><li> ስብከት</li></Link>
             </li>  

             <li className='mb-4 rounded hover:shadow hover:bg-blue-300 py-2'>
                 <a href="" className='px-3'>
                      <FaArchive className='inline-block w-8 h-6 mr-6'></FaArchive> 
                    
                 </a>
                 <Link className='inline-block ' to='favorite'><li>ማሕፉዳ</li></Link>
             </li> 

             <li className='mb-4 rounded hover:shadow hover:bg-blue-300 py-2'>
                 <a href="" className='px-3'>
                      <FaCalendarDay className='inline-block w-8 h-6 mr-6'></FaCalendarDay> 
                    
                 </a>
                 <Link className='inline-block ' to='calender'><li>ዓውደ ኣዋርሕ</li></Link>
             </li> 

             <li className='mb-4 rounded hover:shadow hover:bg-blue-300 py-2'>
                 <a href="" className='px-3'>
                      <FaCog className='inline-block w-8 h-6 mr-6'></FaCog> 
                   
                 </a>
                  <Link className='inline-block ' to='setting'><li>setting</li></Link>
             </li> 
            
        </ul>
        </div>:null}
        
        <button onClick={toggle}>
          {Sidebar?"s":"h"}
            </button>
        
    
  

    <div className='  w-full'>
   
             
<div className='bg-[url("meskel.jpg")] bg-cover bg-no-repeat  w-full'>
<div className=' flex justify-between '>
    <div className='justify-items-center border border-x-4 '>
              <h1 className='ml-96 text-gray-950 font-extrabold text-3xl mt-12'>ናይ ማዓልቱ ንባብ</h1>
                <p className='ml-96  text-gray-950 font-bold text-2xl mt-6'>titel:ሰንበት ዘደብረ ዘይት
                </p>
                <p className='ml-3 mr-96  text-black font-medium text-xl mt-6 flex justify-center'>    ንባባት፡- 1ተሰ.4:13-ፍጻሜ ፣ 2ጴጥ 3፡7-15፣ ግ.ሓ. 24፡1-22፣ ማቴ 24:1-37።
 
 ቅዱስ ዳዊት፡  ኣብ መዝሙሩ  "እግዚአብሔር ብጋህዲ  ክመጽእ እዩ፥ ግናኸ ሰላሕላሕ ኢሉ ኣይኮነን ዝመጽእ ፥ ኣብ ቅድሜኡ ዝባላዕ ሓዊ ኣሎ፡ ህቦብላ ንፋስ እውን ይኸቦ" ይብል  (መዝ.50፡3)። 
 
  መዝሙር  “ጎይታና ኢየሱስ ክርስቶስ ኣብ ደብረ-ዘይቲ ተቐሚጡ ንኣርድእቱ፣ ብዙኃት ብስመይ አነ ክርስቶስ እየ እናበሉ ክመጹኹም እዮም እሞ ከየስሕቱኹም ተጠንቀቑ  ተሰናዲኹም ጽንሑ። እቲ ክሳብ መወዳእታ ተዓጊሱ ዝጸንሕ ንሱ ኪድኅን እዩ።  ኣብ ዳግማይ ምጽኣት ወድሰብ፡ ሓይሊ ሰማያትን ምድርን ኵሉ ክካወስ ጥዋዕዋዕ ክብል እዩ። ሽዑ ኩሎም ኃጥኣን   ኣብ ቅድሜኡ ክበኽዩ  እዮም።  ጎይታ ካብ ሰማይ ናብ ምድሪ ብትእዛዙን ብቓሉን ብአእላፋት መላእኽቱን ተዓጂቡ ብቃንዳ መለኸት  ክወርድ እዩ። በታ ሰዓት እቲአ ካብ ሞት ኃጢአት  ይምሓረና” ከመይ  ንሱ  ጎይታ ሰንበትን፡ ፈጣሪ- ሕይወትን  እዩ ። 
 
 ኃሙሻይ ሰንበት፡ ደብረ ዘይት ‘ማእከለ ጾም’ ተባሂሉ ይጽዋዕ (ፍርቂ ዘመን ጾም) ኣቲና ማለት እዩ። ‘ደብረ ዘይት’ ብሸነኽ ምሥራቅ ኢየሩሳሌም ዝርከብ ጎቦ እዩ። ዘሩባቤል ካብ ዝሰርሖ ቤተመቕደስ 75 ሜትሮ ንላዕሊ ብራኸ ዘሎዎ ቦታ ኢዩ። ኣብ ትሕቲኡ ድማ ቤተፋጌን ቢታንያን ጌተሰማኒ ዝበሃላ ታሪኻዊ ቦታታት ኣሎዉ። ማርቆስ ወንጌላዊ ኢየሱስ ጎይታ፡ ብዕለተ ሆሳእና ካብ ጸብረዘይት ናብ ኢየሩሳሌም ከምዝኸደ ይነግረና (ማር. 11:1)። ኣብ ደብረ-ዘይቲ ሒዝዎም ምስ ደየበ ከኣ እዮም  ቅዱሳን ሓዋርያት ብሕት ኢሎም. . . ትእምርቲ ምምጻእካን ናይ መወዳእታ ዓለም ምልክታቱን እንታይ እዩ፧ እዚ መዓስ እዩ ዚኸውን፧ እስኪ ንገረና እናበሉ ናብኡ ምስ ቀረቡ ብዛዕባ ኅልፈተ ዓለምን ዳግም ምጽኣቱን ዝመሃረሉ እምባ ስለዝኾነ፡ እዛ ሰንበት’ዚኣ ደብረ ዘይት ተባህለት። ኣብዛ ሰንበት’ዚኣ ዚዝመር መዝሙርን ዚንበብ መጻሕፍትን ነቲ ጐይታ ኣብ ደብረ ዘይት ዚመሃሮ ብዛዕባ ምሥጢረ ምጽኣቱን፡ ምልክታት ኅልፈተ ዓለምን ዘመልክት እዩ።
 
 ሰንበት ዘደብረ ዘይት ንዳግማይ ምጽአት ክርስቶስ ክንሰናዶ ከም ዘሎና የዘኻኽረና። አብ እምነትና ክልተ ምጽአት ክርስቶስ ከም ዘሎ ንአምን። 1ይ ኢየሱስ ክርስቶስ ሥጋና ለቢሱ ካብ ድንግል ማርያም ቅድሚ ምውላዱ ዝነበረ ጊዜ። 2ይ ክርስቶስ ድሕሪ ሞቱ ትንሣኤኡን ዕርገቱን  ብግርማ መለኮት ክመጽእ ምዃኑ እሞ ንኹሉ ብዳግም ክፈርዶ እዩ። ሎሚ ክንሓስበሉ ተደልዩ ዘሎ ዳግማይ ምጽአት ክርስቶስ እዩ። አብ ሕይወትና ሓንቲ መዓልቲ አብ ቅድሚ መንበር አምላኽ አብዛ  ምድሪ ዘሕለፍናዮ ግብሪ ክንሕተተሉ ምዃና ፈሊጥና ስንቂ  ሰማይ ክነሰናዱ ከም ዝግብአና ክንሓስብ አሎና። ክልተ ፍርዲ ይጽበየና አሎ። (2ቆሮ.5፡1-10)። 
 
 ትንቢት ዘካርያስ 14:3-7፦   "ሽዑ እግዚኣብሔር ከምቲ ብዘበን ቀደም ዝተዋግኦ፡ ነሕዛብ ኪዋጎም ኪወጽእ እዩ። በታ መዓልቲ እቲኣ ኣብ ምብራቕ ኢየሩሳሌም ኣብ ዘሎ ደብረዘይት ኪቐውም እዩ። እቲ ደብረ ዘይቲ ካብ ምብራቕ ክሳዕ ምዕራብ ኣብ ክልተ ክስንጠቕ ኣዝዩ ዓቢ ሽንጭሮ ድማ ክኸውን እዩ። ፍርቂ እቲ ከረን ናብ ሰሜን ፍርቁ ድማ ናብ ደቡብ ክሰሓብ እዩ። ሽንጭሮ  እቲ ኣኽራን ክሳዕ ኣጸል ክበጽእ እዩ እሞ ንስኻትኩም በቲ ሽንጭሮ ኣኽራነይ ክትሃድሙ ኢኹም። ኣቦታትኩም ብዘመን ኦዝያን ንጉስ ይሁዳ ካብ ምንቅጥቃጥ ምድሪ ከም ዝሃደሙ፡ ክትሃድሙ ኢኹም። እግዚኣብሔር ኣምላኽ ከኣ ምስ ኩሎም መላእኽቱ ክመጽእ እዩ….. በታ መዓልቲ እቲኣ ቁሪ ኮነ ኣሳሓይታ ኣይክህሉን እዩ።
 
  ኩሉ ግዜ ብለይቲ እውን ከይተረፈ ብርሃን ቀትሪ ክኸውን እዩ …. እዚ መዓስ ከምዝኸውን ግን እግዚኣብሔር ጥራሕ እዩ ዝፈልጦ"።
 
    እቲ ቀንዲ እቲ መጀመርያ ፍርዲ እዩ ክንሓስበሉ ዘሎና ምኽንያቱ አብ ክርስትና ሓቀኛን ቅኑዕን ሕይወት እንተ መራሕና ዝጽበየና  ፍርዲ  ናይ ክብርን ሞገስን  እዩ  ክኸውን፥ እንተኾነ  መገዲ አምላኽ ስሒትና  እንነብር እንተኾይና ፍርድና ኩነኔ እዩ ዝስዕቦ። ናይ ሎሚ ሰንበት መዝሙር  እምበአር፡  ነዚ አብ ግምት አእቲና ክንጥንቀቐሉን ክንሓስበሉን ዘሎና ነገራት ይነግረና። ኢየሱስ ዘታልሉ ብስመይ ከመጽኡኹም እዮም እሞ ከየስሕትኹም ተጠንቀቁ ኩሉ ጊዜ ተሰናዲኹም ጽንሑ ይብለና። ናይዚ ምልክት ቅድሚ ሕጂ “ብስም ክርስቶስ መጺኦም ነይሮም፡ ብሕጂ’ውን ብዝገደደ ኪመጽኡ እዮም። ብስም ክርስቶስ ትካላት እምነት ዝምሥርቱ፣ ክርስቶስ ብሕልምን ራእይን ተገሊጽለይ እናበሉ ዚመጽኡን  ዘለዉን ኣዝዮም ብዙኃን እዮም።” መስሓትቲ ብምዃኖም ድማ ንከየስሕቱና ክንጥንቀቕን ኣብ ሃይማኖትና ጸኒዕና ኽንቃወሞምን ‘ዑቍኬ ኢያስሕቱክሙ/ ከየስሕቱኹም ተጠንቀቑ’ ኢሉ የጠንቅቐና። አብ ሕይወትን፡ ክርስቲያናዊ መስመርናን  ትዕግስትን ምስትውዓልን ከም ዘድሊ ክነግረና ኢሉ ኸአ ክሳብ መወዳእታ ተዓጊሱ ዝጸንሐ  ክድሕን እዩ ይብለና።  ንዳግማይ ምጽአት ዝሕብሩ  ምልክታት ክርአዩ እዮም እሞ፡ ክነስተውዕል ይነግረና።  አብ ቅዱስ መጽሓፍ እንተተመልከትና፡  ማይ አይኂ ንኖኅ ምኽንያት ድሕነቱ ኮይንዎ፡  ነቶም ሰብ ሰዶምን ጎሞራን ግን ናይ ጥፍአቶም ምልክት ኮነ።  
 
 • “ውግእን ወረ ውግእን ክትሰምዑ ኢኹም . . . ሕዝቢ ናብ ሕዝቢ፡ መንግሥቲ‘ውን ናብ መንግሥቲ ኪለዓል እዩ” ሃገር ምስ ሃገር፣ ኣብ ውሽጢ ሃገር ነንሓድሓዱ፤ ኣብ መንጎ ሥድራን ቤተሰብን፡ ኣብ ሓደ ሰብ ሥጋን ነፍስን . . . ውግእን  ፍልልይን ዝኸፍኣሉ ዘመን ብምህላውና፡ ነቲ ትእምርቲ ምጽኣቱ ብሩህ ይገብሮ።
 
 • “ኣብ በቦታኡ ድማ ጥሜትን ፌራን  ምንቅጥቃጥ ምድርን ኪኸውን እዩ . . . ” ብተፈጥሮን ሰብ ብዝሠርሖን ሕልቂት ሕዝቢ፤ ምንቅጥቃጥ ምድሪ ብዝኸፍአ ሳዕቤን፡ ብዝቐልጠፈ ተርእዮን ሎሚ ዓለም ተናዊጻ ምህላዋ ርዱእ ትእምርቲ ምጽኣቱ እዩ። ምዕቡል ዘመን ኣብ ዝተባህለሉ ጊዜ ክብሪ እኽለ ማይን፡ ድርቅን ጥሜትን ዓጸቦን ዝገደደሉ ጊዜ እዩ። ካብዚ ዝገደደ ግና ረኃብ ነፍሲ፡ ጥሜት እንጌራን ጽምኢ ማይን ዘይኮነስ፡ ረኃብ ቃለ እግዚአብሔር ምህላዉ እዩ። ሰብ ሃይማኖቱ ኃዲጉ፡ ንዓውለማ ዝተገዝኣሉ፡ ዝያዳ ቃል እግዚኣብሔር ኣድህቦን ኣድናቖትን ዝህቦ ንስፖርተኛታት፡ ደርፍቲ፡ ተዋሳእቲ . . . ወዘይመስሎ ብምህላዉ እቲ ጊዜ ምቕራቡ ዘረድእ እዩ።
 
 ቅዱስ ጴጥሮስ “ግና መወዳእታ ዅሉ ነገር ቀሪቡ እዩ፡ ስለዚ ርእስኹም ግትኡ ንጸሎት’ውን ንቕሑ” (1ይ.ጴጥ.4፡7) እናተባህለ ንሕና ግና ነቲ “ንቕሑ” ዝብል ቃል ዝዘንጋዕናዮ ንመስል። እሞ’ኸ ደኣ ኣብ’ታ መዓልቲ ፍርዲ ንዝቐርበልና ሕቶ ምላሽ ንምሃብ ድልዋን ዲና፧ ነታ መዓልቲ ብሓቂ ከምዚ ዘለናዮ ዲና ክንጽበያ፧ ያእ ኣይፋልናን! ሕዝበ ክርስቲያን ነቲ ኵሉ ዝተዋህበና ሰምዕታ ከነስተብህለሉ ይግብኣና።
 
  ቅዱስ ጳውሎስ  ናብ ተሰሎንቄ ክርስትያን መልእኽቱ “ እቲ ብኅቡእ ዝዓዪ ሕጊ ኣልቦነት ድሮ ጀሚሩ ኣሎ። እንተኾነ እቲ ክኾኖ ዘሎዎ እቲ ዓጊትዎ ዘሎ ካብ መገዱ ክሳዕ ዘልግስ ኣይክኸውንን እዩ፡ ሽዑ እቲ ሕጊ ዘይብሉ ክግለጽ እዩ ጎይታ ኢየሱስ ከኣ በቲንካብ ኣፉ ዝወጽእ ትንፋስ ከጥፍኦ እዩ…. ብግርማ  ምጽኣቱ  ከኣ ክድምስሶ እዩ። ናይቲ ሕጊ ዘይብሉ ምምጻእ፡  በቲ ሰይጣን ዝዓዮ ዘሎ ኩሉ ናይ ሓይልን ሓሳዊ ትእምርትን ተኣምራትን ዝተሰነየ ክኸውን እዩ ነቶም ዝጠፍኡ ዘስሕተሉ ተንኮልን ክፍኣትን ኣሎዎ …እቶም ዝጠፍኡ ከኣ ነቲን ከድሕኖም ዝኽእል ሓቂ ብፍቕሪ ምቕባኣል ስለዝኣበዩ እዩ ”(2ተሰ.2፡ 7-10)።
 
 
 አብ ትምህርቲ  እምነትና ብዛዕባ ናይ ደቂ ሰብ መፈጸምታታት ክልተ ነገር አለዉ ብዝያዳ ክነስተውዕለሎም ዘሎና።
 
  • አብ ሞት ነፍስወከፍና መወዳእታትና እዩ፥ ምስ ሞትና ሽዑ ጸብጻብ ሕይወትና አብ ቅድሚ አምላኽ ነቕርብ። “አብ ዳግማይ ምጽአቱ ምስ ክርስቶስ ዚግበር መወዳእታ ርክብ እዩ ዚጥምቶ። ግና ኸአ ነፍስወከፍ ብኡብኡ ብድሕሪ ሞቱ ብመጠን ተግባራቱን እምነቱን ዓስቡ ከምዝቕበል፥ ሓዲስ ኪዳን ደጋጊሙ ዜረጋግጾ እዩ። ናይቲ ድኻ አልአዛር ምሳሌ ኮነ፥ አብ መስቀል ኮይኑ ኢየሱስ ነቲ ብየማኑ ዝተሰቕለ ሰራቒ ዝበሎ ቃላት ኩሉ አብነት እዩ። ነፍስወከፍ ሰብ አብ ጊዜ ሞቱ ንሕይወቱ ምስ ክርስቶስ ብዘነጻጽር ብናይ ፍላይ ፍርዲ፥ አብታ ዘይትመውት ነፍሱ ዘለዓለማዊ ቅጽዓቱ ይቕበል። (ሓ/ት/ክ 1021/1022)። ሰብ ብግሉ ድሕሪ ሞቱ አብ ቅድሚ አምላኽ ስለ ዝቐርብ ክሰናደወሉ ከምዝግባእ ክፈልጥ አለዎ። ከይተሰናዶኻ ሞት ከም ሰራቒ ከይተመጽአካ ዓቢ ምስትውዕል ይሓትት።
 
   • ሓባራዊ  ፍርዲ፡ አብ መጨረሽታ ዓለም ሓባራዊ ፍርዲ አሎ። “ቅድሚ ናይ መወዳእታ ፍርዲ ትንሣኤ ሙታን ማለት “ናይ ጻድቃንን ኃጥአንን ክልቲኦም” ትንሣኤ (ግ.ሓ. 24፡15) ኪፍጸም እዩ። እዚ ኸአ “እቶም አብ መቓብር ዘለዉ ኵላቶም ድምፁ ዚሰምዑላ ሰዓት ክትመጽእ እያ. . . . . ሽዑ እቶም ሠናይ ዝገበሩ ናብ ትንሣኤ  ሕይወት እቶም ክፉእ ዚገበሩ ድማ ናብ ትንሣኤ ኵነኔ ኪኸዱ እዮም (ዮሓ 5፡2829) ድሕርዚ ክርስቶስ “ብኽብሩ ኪመጽእ እዩ፥ ኵሎም  መላእኽቱ’ዉን ምስኡ. . . . ኵሎም አሕዛብ ድማ አብ ቅድሜኡ ኪእከቡ እዮም። ጓሳ ነባግዕ ካብ አጣል ከምዝፈላሊ ከምኡ ከአ ንሱ በብወገኖም ኪፈልዮም፥ ነባግዕ ብየማኑ፥ ነጣል ብጸጋሙ ኬቕውም እዩ. . .. . . ሽዑ እዚአቶም ናብ ናይ ዘለዓለም ቅጽዓት፥ ጻድቃን ግና ናብ ዘለዓለማዊ ሕይወት ኪኸዱ እዮም (ማቴ 25፡ 31፥32፥46)። እቲ መወዳእታ  ፍርዲ ዚኸውን ክርስቶስ ብኽብሪ ምስተመልሰ እዩ። ነታ ዕለትን ሰዓትን ዚፈልጣ ግን አቦ ጥራሕ እዩ። ናይ እቲአ ዕለት እቲአ ምጽአት ዚውስን ከአ ንሱ ጥራሕ እዩ . . . .(ሓ/ት/ክ 1040)።
 
  እቲ ተስፋና ግና ኣብ መጽሓፈ ዕብራዉያን  9:28 ኣሎ "እቲ ናይ ብዙኃት ኃጢኣት  ምእንቲ ከርሕቕ ሓንሳብ ዝተሰውዐ ክርስቶስ፣ ኃጢኣት ክጸውር ዘይኮነስ ንምድኃን እቶም ዝጽበይዎ ካልኣይ ግዜ ክግለጽ እዩ" ። እምበር እዚ ሎሚ ዝተነበ ቃል አምላኽ ክንፈርሕ አይኮነን ተጻሒፉ ጉዳይ ሰማይ ከገድስና  ስለዘሎዎ ጥራሕ  እዩ። ቅዱስ ጳውሎስ “ግና አኅዋተይ ከምቶም ተስፋ ዘይብሎም ካልኦት ምእንቲ ኸይትኃዝኑ ብዛዕባ እቶም ዝሞቱ ኽትፍለጡ እደሊ አሎኹ. . . . አምላኽ ነቶም ንኢየሱስ አሚኖም ዝሞቱ ምስኡ ኸም ዘተንሥኦም ንአምን ኢና” (1ተሰሎ.4፡13-14)፥ እናበለ ቅድሚ ሞት ክህልወና ዝግብኦ ርድኢትን ኩነትን ይነግረና። 
 
 ደጊሙ ጳውሎስ አብ ግ.ሓ. ንዝቐረበሉ  ክሲ ክምልስ እንከሎ “ከምቲ ንሳቶም ዚትስፈዉዎ፡ አነውን  ጻድቃንን ኃጥአንን ካብ ሞት ከምዚትንሥኡ አብ አምላኽ ተስፋ አሎኒ፥ ስለዚ ኸአ እየ አብ ቅድሚ አምላኽ ኮነ፡ አብ ቅድሚ ሰብ ብንጹሕ ሕልና ኽነብር ዝጽዕር ዘሎኹ” (ግ.ሓ. 24፡15-16) ብዝበሎ መሪሕ ቃል፡ ተጠቒምና ሕይወትና ንጎይታ ክንህቦ ንዕደም ኣሎና ።
 
   ወስብሐት ለእግዚኣብሔር!!!
 ኣባ ዮናስ ዮሓንስ

</p>
              </div>
              
              <div className='justify-items-center'>
              <h1 className='mr-96 text-gray-950  font-extrabold text-3xl mt-12'>ናይ ማዓልቱ ስብከት</h1>
                <p className='mr-96  text-gray-950  font-bold text-2xl mt-6'>titel:</p>
                <p className='mr-96 ml-3 text-black font-medium text-xl mt-6'>ወተንሥአ እግዚብሔር ከም ዘንቃሕ 
እምንዋም፣
 ወከመ ኃያል ወኅዳገ ወይን፣
 ወቀተለ ጸሮ በድኅሬሁ።
 (መዝ 77፡65-66)
</p>
              </div>
              

              </div>
              

</div>

  
    </div>


    </div>

    </>
  )
}

export default Home